FIOLOG/nvme0n1_220606_122215_fio.log
/dev/nvme0n1: (g=0): rw=randwrite, bs=(R) 512B-64.0KiB, (W) 512B-64.0KiB, (T) 512B-64.0KiB, ioengine=libaio, iodepth=256
...
fio-3.28
Starting 4 processes

fio: terminating on signal 2

/dev/nvme0n1: (groupid=0, jobs=4): err= 0: pid=997880: Mon Jun  6 12:22:26 2022
  write: IOPS=27.9k, BW=208MiB/s (219MB/s)(2120MiB/10168msec); 0 zone resets
    slat (nsec): min=1919, max=3415.8k, avg=10772.46, stdev=14982.89
    clat (usec): min=1560, max=159792, avg=36704.97, stdev=23635.43
     lat (usec): min=1569, max=159799, avg=36715.95, stdev=23636.66
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    8], 10.00th=[   11], 20.00th=[   15],
     | 30.00th=[   21], 40.00th=[   31], 50.00th=[   34], 60.00th=[   38],
     | 70.00th=[   42], 80.00th=[   59], 90.00th=[   66], 95.00th=[   80],
     | 99.00th=[  108], 99.50th=[  125], 99.90th=[  138], 99.95th=[  142],
     | 99.99th=[  148]
   bw (  KiB/s): min=124989, max=507565, per=98.21%, avg=209654.60, stdev=23466.44, samples=80
   iops        : min=16633, max=67496, avg=27408.60, stdev=3124.17, samples=80
  lat (msec)   : 2=0.12%, 4=1.29%, 10=7.01%, 20=21.00%, 50=45.58%
  lat (msec)   : 100=22.66%, 250=2.34%
  cpu          : usr=5.14%, sys=8.24%, ctx=60749, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,283478,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
  WRITE: bw=208MiB/s (219MB/s), 208MiB/s-208MiB/s (219MB/s-219MB/s), io=2120MiB (2223MB), run=10168-10168msec

Disk stats (read/write):
  nvme0n1: ios=48/306812, merge=0/0, ticks=106/10967429, in_queue=10967534, util=100.00%