FIOLOG/nvme0n1_220606_122515_fio.log
/dev/nvme0n1: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1009826: Mon Jun  6 12:26:15 2022
  write: IOPS=2786, BW=348MiB/s (365MB/s)(20.4GiB/60011msec); 0 zone resets
    slat (usec): min=7, max=342, avg=33.96, stdev=13.35
    clat (usec): min=7663, max=37486, avg=11446.96, stdev=2345.32
     lat (usec): min=7715, max=37508, avg=11481.35, stdev=2345.90
    clat percentiles (usec):
     |  1.00th=[10028],  5.00th=[10159], 10.00th=[10290], 20.00th=[10421],
     | 30.00th=[10552], 40.00th=[10683], 50.00th=[10814], 60.00th=[10945],
     | 70.00th=[11076], 80.00th=[11469], 90.00th=[12780], 95.00th=[16057],
     | 99.00th=[20841], 99.50th=[27919], 99.90th=[33817], 99.95th=[34866],
     | 99.99th=[36439]
   bw (  KiB/s): min=242432, max=401152, per=100.00%, avg=356891.97, stdev=40849.79, samples=119
   iops        : min= 1894, max= 3134, avg=2788.22, stdev=319.14, samples=119
  lat (msec)   : 10=1.16%, 20=97.72%, 50=1.12%
  cpu          : usr=6.35%, sys=8.90%, ctx=77006, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,167200,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=348MiB/s (365MB/s), 348MiB/s-348MiB/s (365MB/s-365MB/s), io=20.4GiB (21.9GB), run=60011-60011msec

Disk stats (read/write):
  nvme0n1: ios=48/501435, merge=0/0, ticks=151/5716448, in_queue=5716598, util=100.00%