FIOLOG/nvme0n1_220606_122636_fio.log
/dev/nvme0n1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1009969: Mon Jun  6 12:26:46 2022
  read: IOPS=1199, BW=4799KiB/s (4914kB/s)(47.2MiB/10065msec)
    slat (usec): min=2, max=1131, avg=15.89, stdev=15.45
    clat (usec): min=1270, max=116362, avg=53310.39, stdev=16882.21
     lat (usec): min=1288, max=116370, avg=53326.64, stdev=16882.25
    clat percentiles (msec):
     |  1.00th=[    9],  5.00th=[   27], 10.00th=[   33], 20.00th=[   41],
     | 30.00th=[   46], 40.00th=[   50], 50.00th=[   53], 60.00th=[   57],
     | 70.00th=[   61], 80.00th=[   66], 90.00th=[   74], 95.00th=[   84],
     | 99.00th=[   97], 99.50th=[  103], 99.90th=[  114], 99.95th=[  114],
     | 99.99th=[  116]
   bw (  KiB/s): min= 3472, max= 6800, per=25.02%, avg=4804.40, stdev=964.74, samples=20
   iops        : min=  868, max= 1700, avg=1201.10, stdev=241.19, samples=20
  lat (msec)   : 2=0.60%, 10=0.43%, 20=0.90%, 50=40.43%, 100=56.94%
  lat (msec)   : 250=0.69%
  cpu          : usr=2.09%, sys=2.43%, ctx=3539, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.3%, >=64=99.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=12075,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1009970: Mon Jun  6 12:26:46 2022
  read: IOPS=1199, BW=4799KiB/s (4914kB/s)(47.2MiB/10065msec)
    slat (usec): min=2, max=316, avg=15.94, stdev=11.98
    clat (usec): min=1361, max=116461, avg=53309.82, stdev=16955.12
     lat (usec): min=1372, max=116471, avg=53326.12, stdev=16955.32
    clat percentiles (msec):
     |  1.00th=[    9],  5.00th=[   26], 10.00th=[   33], 20.00th=[   41],
     | 30.00th=[   46], 40.00th=[   50], 50.00th=[   54], 60.00th=[   58],
     | 70.00th=[   62], 80.00th=[   66], 90.00th=[   74], 95.00th=[   83],
     | 99.00th=[   97], 99.50th=[  102], 99.90th=[  109], 99.95th=[  112],
     | 99.99th=[  115]
   bw (  KiB/s): min= 3568, max= 6896, per=25.02%, avg=4804.80, stdev=953.66, samples=20
   iops        : min=  892, max= 1724, avg=1201.20, stdev=238.42, samples=20
  lat (msec)   : 2=0.65%, 4=0.03%, 10=0.32%, 20=1.56%, 50=38.36%
  lat (msec)   : 100=58.43%, 250=0.64%
  cpu          : usr=1.78%, sys=2.81%, ctx=3637, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.3%, >=64=99.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=12075,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1009971: Mon Jun  6 12:26:46 2022
  read: IOPS=1201, BW=4808KiB/s (4923kB/s)(47.3MiB/10065msec)
    slat (usec): min=2, max=370, avg=16.25, stdev=12.67
    clat (usec): min=1270, max=121382, avg=53212.82, stdev=17138.85
     lat (usec): min=1318, max=121390, avg=53229.41, stdev=17139.12
    clat percentiles (msec):
     |  1.00th=[   11],  5.00th=[   25], 10.00th=[   31], 20.00th=[   40],
     | 30.00th=[   46], 40.00th=[   51], 50.00th=[   54], 60.00th=[   57],
     | 70.00th=[   62], 80.00th=[   67], 90.00th=[   74], 95.00th=[   83],
     | 99.00th=[   96], 99.50th=[  101], 99.90th=[  116], 99.95th=[  120],
     | 99.99th=[  122]
   bw (  KiB/s): min= 3640, max= 6704, per=25.07%, avg=4813.60, stdev=940.15, samples=20
   iops        : min=  910, max= 1676, avg=1203.40, stdev=235.04, samples=20
  lat (msec)   : 2=0.67%, 4=0.02%, 10=0.26%, 20=1.92%, 50=37.15%
  lat (msec)   : 100=59.39%, 250=0.60%
  cpu          : usr=1.48%, sys=3.24%, ctx=3751, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.3%, >=64=99.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=12097,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1009972: Mon Jun  6 12:26:46 2022
  read: IOPS=1198, BW=4793KiB/s (4908kB/s)(47.1MiB/10065msec)
    slat (usec): min=2, max=191, avg=16.07, stdev=11.95
    clat (usec): min=1520, max=115453, avg=53370.79, stdev=16862.24
     lat (usec): min=1529, max=115473, avg=53387.22, stdev=16862.43
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   25], 10.00th=[   31], 20.00th=[   41],
     | 30.00th=[   46], 40.00th=[   51], 50.00th=[   54], 60.00th=[   58],
     | 70.00th=[   62], 80.00th=[   66], 90.00th=[   75], 95.00th=[   82],
     | 99.00th=[   96], 99.50th=[  101], 99.90th=[  105], 99.95th=[  107],
     | 99.99th=[  113]
   bw (  KiB/s): min= 3544, max= 6888, per=25.00%, avg=4799.20, stdev=941.44, samples=20
   iops        : min=  886, max= 1722, avg=1199.80, stdev=235.36, samples=20
  lat (msec)   : 2=0.27%, 4=0.21%, 10=0.35%, 20=1.31%, 50=38.16%
  lat (msec)   : 100=59.18%, 250=0.51%
  cpu          : usr=1.22%, sys=3.46%, ctx=3729, majf=0, minf=77
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.3%, >=64=99.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=12061,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=18.7MiB/s (19.7MB/s), 4793KiB/s-4808KiB/s (4908kB/s-4923kB/s), io=189MiB (198MB), run=10065-10065msec

Disk stats (read/write):
  nvme0n1: ios=47424/81228, merge=0/0, ticks=2521701/627992, in_queue=3149693, util=100.00%