FIOLOG/nvme0n1_220606_122657_fio.log
/dev/nvme0n1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 2 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1010058: Mon Jun  6 12:27:27 2022
  write: IOPS=4227, BW=16.5MiB/s (17.3MB/s)(496MiB/30005msec); 0 zone resets
    slat (nsec): min=1950, max=119788, avg=12069.69, stdev=9131.16
    clat (usec): min=6212, max=26310, avg=7554.26, stdev=1297.53
     lat (usec): min=6247, max=26318, avg=7566.67, stdev=1297.33
    clat percentiles (usec):
     |  1.00th=[ 6587],  5.00th=[ 6783], 10.00th=[ 6915], 20.00th=[ 7046],
     | 30.00th=[ 7177], 40.00th=[ 7308], 50.00th=[ 7439], 60.00th=[ 7570],
     | 70.00th=[ 7701], 80.00th=[ 7832], 90.00th=[ 8094], 95.00th=[ 8356],
     | 99.00th=[ 8979], 99.50th=[21365], 99.90th=[24511], 99.95th=[24511],
     | 99.99th=[26084]
   bw (  KiB/s): min=15872, max=17920, per=50.07%, avg=16939.39, stdev=548.61, samples=59
   iops        : min= 3968, max= 4480, avg=4234.85, stdev=137.15, samples=59
  lat (msec)   : 10=99.33%, 20=0.13%, 50=0.53%
  cpu          : usr=3.71%, sys=6.26%, ctx=21948, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,126848,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1010059: Mon Jun  6 12:27:27 2022
  write: IOPS=4229, BW=16.5MiB/s (17.3MB/s)(496MiB/30008msec); 0 zone resets
    slat (nsec): min=1964, max=343575, avg=12361.06, stdev=9291.87
    clat (usec): min=6266, max=26289, avg=7549.95, stdev=1305.40
     lat (usec): min=6300, max=26298, avg=7562.65, stdev=1305.24
    clat percentiles (usec):
     |  1.00th=[ 6587],  5.00th=[ 6783], 10.00th=[ 6915], 20.00th=[ 7046],
     | 30.00th=[ 7177], 40.00th=[ 7308], 50.00th=[ 7373], 60.00th=[ 7504],
     | 70.00th=[ 7701], 80.00th=[ 7832], 90.00th=[ 8094], 95.00th=[ 8356],
     | 99.00th=[ 8979], 99.50th=[21627], 99.90th=[24511], 99.95th=[24511],
     | 99.99th=[26084]
   bw (  KiB/s): min=15872, max=17928, per=50.10%, avg=16949.69, stdev=555.20, samples=59
   iops        : min= 3968, max= 4482, avg=4237.42, stdev=138.80, samples=59
  lat (msec)   : 10=99.33%, 20=0.13%, 50=0.54%
  cpu          : usr=3.50%, sys=6.81%, ctx=23542, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,126928,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=33.0MiB/s (34.6MB/s), 16.5MiB/s-16.5MiB/s (17.3MB/s-17.3MB/s), io=991MiB (1039MB), run=30005-30008msec

Disk stats (read/write):
  nvme0n1: ios=48/506882, merge=0/0, ticks=109/3793031, in_queue=3793140, util=100.00%